In [60]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("database.db")
cursor = conn.cursor()

In [61]:
pd.read_sql_query("""SELECT Female.employee_name
                  FROM Female
                  INNER JOIN Works_on ON Female.employee_name = Works_on.employee_name
                  INNER JOIN Supervise ON Female.employee_name = subordinate_name
                  WHERE effort >= 10
                  AND   project = "computerization"
                  AND   supervisor_name = "jennifer"
                  """, conn)

  employee_name
0        alicia

In [62]:
pd.read_sql_query("""SELECT Department.employee_name 
                  FROM Department 
                  INNER JOIN Salary 
                  ON Department.employee_name=Salary.employee_name
                  WHERE department = 'research' 
                  AND salary > 40000;
                  """, conn)

  employee_name
0      franklin

In [63]:
pd.read_sql_query("""SELECT Employee.employee_name 
                  FROM Employee
                  LEFT JOIN Supervise 
                  ON Employee.employee_name = Supervise.subordinate_name
                  WHERE Supervise.subordinate_name IS NULL""", conn)

  employee_name
0         james

In [66]:
# I am assuming that you will want to include employees that work on SPECIFICALLY product x for at least 20 hours. 
pd.read_sql_query("""SELECT employee_name
                  FROM Works_on
                  WHERE project = "productx"
                  AND effort >= 20
                  """, conn)

# If you want employees who work at least 20 hours, and have worked on product x, then run the commented code instead

# pd.read_sql_query("""SELECT Works_on.employee_name AS employee_name
#                   FROM Works_on, Works_on AS Second
#                   WHERE Second.project = "productx"
#                   AND Works_on.employee_name = Second.employee_name
#                   GROUP BY Works_on.employee_name
#                   HAVING (SUM(Works_on.effort)) >= 20
#                   """, conn)

  employee_name
0          john
1         joyce

In [67]:
cursor.close()